<a href="https://colab.research.google.com/github/renatoquiliche/DataScience-PUCRio-FB/blob/main/Task%201/RobertaLeticia.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
#1)Carregar o dataset Data Science Job Salaries no software utilizado e 
#gerar estatísticas descritivas (extra: desenvolver os exercícios 1, 2, 3 e 4 usando o 
#dataset do seus projetos da disciplina)

library(data.table)
library(dplyr)
df <- read.csv("https://raw.githubusercontent.com/renatoquiliche/DataScience-PUCRio-FB/main/Data/DS_salarios/ds_salaries.csv")

library(Hmisc)


#install.packages('data.table')
library(data.table)

Loading required package: lattice

Loading required package: survival

Loading required package: Formula

Loading required package: ggplot2


Attaching package: ‘Hmisc’


The following objects are masked from ‘package:dplyr’:

    src, summarize


The following objects are masked from ‘package:base’:

    format.pval, units

In [9]:
summary(df)  
#mostra um resumo estatístico de df, como mínimos, medianas, médias, tamanho, 
#máximos, dentre outros.

       X           work_year      work_month     experience_level
 Min.   :  0.0   Min.   :2020   Min.   : 1.000   Length:607
 1st Qu.:151.5   1st Qu.:2021   1st Qu.: 4.000   Class :character
 Median :303.0   Median :2022   Median : 6.000   Mode  :character
 Mean   :303.0   Mean   :2021   Mean   : 6.473
 3rd Qu.:454.5   3rd Qu.:2022   3rd Qu.: 9.000
 Max.   :606.0   Max.   :2022   Max.   :12.000
 employment_type     job_title             salary         salary_currency
 Length:607         Length:607         Min.   :    4000   Length:607
 Class :character   Class :character   1st Qu.:   70000   Class :character
 Mode  :character   Mode  :character   Median :  115000   Mode  :character
                                       Mean   :  324000
                                       3rd Qu.:  165000
                                       Max.   :30400000
 salary_in_usd    employee_residence  remote_ratio    company_location
 Min.   :  2859   Length:607         Min.   :  0.00   Length:607
 1st Qu.: 62726   Class :character   1st Qu.: 50.00   Class :character
 Median :101570   Mode  :character   Median :100.00   Mode  :character
 Mean   :112298                      Mean   : 70.92
 3rd Qu.:150000                      3rd Qu.:100.00
 Max.   :600000                      Max.   :100.00
 company_size
 Length:607
 Class :character
 Mode  :character

In [10]:
# 2) Aplicar uma técnica de amostragem (sugestão: aplicar bootstrap)
transpose(sample(transpose(df), size = 200, replace = TRUE))

    V1  V2   V3 V4 V5 V6                                 V7      V8  V9     V10
1   526 2022 3  MI FT Data Scientist                     78000   USD 78000  US
2   305 2022 1  SE FT Data Analyst                       99000   USD 99000  US
3   403 2022 6  SE FT Data Analyst                       81666   USD 81666  US
4   551 2022 9  SE FT Data Scientist                     140400  USD 140400 US
5   466 2022 4  SE FT Research Scientist                 144000  USD 144000 US
6   559 2022 11 SE FT Data Scientist                     140400  USD 140400 US
7   228 2021 11 SE FT Data Scientist                     135000  USD 135000 US
8   436 2022 8  MI FT Data Engineer                      60000   EUR 65949  ES
9   152 2021 10 MI FT Data Scientist                     95000   CAD 75774  CA
10  155 2021 10 SE FT Data Science Engineer              159500  CAD 127221 CA
11  6   2020 2  SE FT Lead Data Scientist                190000  USD 190000 US
12  340 2022 10 SE FT Data Engineer                      128875  USD 128875 US
13  284 2021 10 MI FT Research Scientist                 69999   USD 69999  CZ
14  241 2021 6  MI FT Data Analyst                       80000   USD 80000  US
15  593 2022 1  SE FT Data Scientist                     150000  USD 150000 US
16  533 2022 8  SE FT Machine Learning Engineer          192600  USD 192600 US
17  249 2021 6  SE FT Principal Data Analyst             170000  USD 170000 US
18  145 2021 12 SE FT Machine Learning Engineer          70000   EUR 82744  BE
19  348 2022 9  SE FT Data Engineer                      113000  USD 113000 US
20  220 2021 8  MI FT Machine Learning Engineer          180000  PLN 46597  PL
21  15  2020 7  MI FT Data Analyst                       8000    USD 8000   PK
22  401 2022 7  SE FT Data Engineer                      154600  USD 154600 US
23  301 2022 8  SE FT Data Scientist                     80000   GBP 104702 GB
24  81  2021 7  MI FT Data Engineer                      140000  USD 140000 US
25  9   2020 6  SE FT Lead Data Engineer                 125000  USD 125000 NZ
26  181 2021 12 MI FT Data Scientist                     76760   EUR 90734  DE
27  489 2022 6  EN CT Applied Machine Learning Scientist 29000   EUR 31875  TN
28  142 2021 11 SE FT Data Engineering Manager           150000  USD 150000 US
29  128 2021 5  EN FT Machine Learning Engineer          20000   USD 20000  IN
30  552 2022 9  SE FT Data Scientist                     176000  USD 176000 US
⋮   ⋮   ⋮    ⋮  ⋮  ⋮  ⋮                                  ⋮       ⋮   ⋮      ⋮
171 556 2022 4  SE FT Data Engineer                      145000  USD 145000 US
172 93  2021 10 SE FT Lead Data Engineer                 276000  USD 276000 US
173 431 2022 1  MI FT Data Analyst                       30000   EUR 32974  ES
174 470 2022 10 MI FT Data Analyst                       135000  USD 135000 US
175 489 2022 6  EN CT Applied Machine Learning Scientist 29000   EUR 31875  TN
176 564 2022 8  SE FT Data Analyst                       116150  USD 116150 US
177 220 2021 8  MI FT Machine Learning Engineer          180000  PLN 46597  PL
178 261 2021 5  SE FT Data Analyst                       54000   EUR 63831  DE
179 196 2021 7  EN FT BI Data Analyst                    9272    USD 9272   KE
180 503 2022 3  MI FT Machine Learning Engineer          121000  AUD 87425  AU
181 491 2022 5  MI FT Principal Data Analyst             75000   USD 75000  CA
182 112 2021 2  SE FT Lead Data Engineer                 75000   GBP 103160 GB
183 11  2020 4  MI FT Data Scientist                     3000000 INR 40481  IN
184 265 2021 9  SE FT Lead Data Engineer                 160000  USD 160000 PR
185 420 2022 2  MI FT Machine Learning Scientist         112300  USD 112300 US
186 296 2022 7  SE FT Data Analyst                       102100  USD 102100 US
187 85  2021 7  MI FT Data Engineer                      110000  PLN 28476  PL
188 359 2022 3  SE FT Data Architect                     90700   USD 90700  CA
189 462 2022 11 MI PT Data Engineer                      50000   EUR 54957  DE
190 371 2022 8  SE FT Machine Learning Engineer          189650  USD 189650 US
191 587 2022 6  SE FT Data Scientist                     140000  USD 140000 US
192 462 2022 11 MI PT Data Engineer                      50000   EUR 54957  DE
193 496 2022 4  EN FT Data Engineer                      52800   EUR 58035  PK
194 65  2020 4  EN FT Data Scientist                     55000   EUR 62726  DE
195 108 2021 5  SE FT Data Engineer                      150000  USD 150000 US
196 436 2022 8  MI FT Data Engineer                      60000   EUR 65949  ES
197 510 2022 12 EN FT Computer Vision Software Engineer  150000  USD 150000 AU
198 322 2022 7  SE FT Data Engineer                      160080  USD 160080 US
199 589 2022 3  SE FT Data Analyst                       60000   USD 60000  US
200 353 2022 5  SE FT Data Scientist                     123000  USD 123000 US
    V11 V12 V13
1   100 US  M
2   0   US  M
3   0   US  M
4   0   US  L
5   50  US  L
6   0   US  M
7   0   US  L
8   100 ES  M
9   100 CA  L
10  50  CA  L
11  100 US  S
12  100 US  M
13  50  CZ  L
14  100 US  L
15  100 US  M
16  100 US  M
17  100 US  M
18  50  BE  M
19  0   US  L
20  100 PL  L
21  50  PK  L
22  100 US  L
23  0   GB  M
24  100 US  L
25  50  NZ  S
26  50  DE  L
27  100 CZ  M
28  0   US  L
29  100 IN  S
30  100 US  M
⋮   ⋮   ⋮   ⋮
171 100 US  M
172 0   US  L
173 100 ES  M
174 100 US  M
175 100 CZ  M
176 100 US  M
177 100 PL  L
178 50  DE  L
179 100 KE  S
180 100 AU  L
181 100 CA  S
182 100 GB  S
183 0   IN  L
184 50  US  S
185 100 US  L
186 100 US  M
187 100 PL  L
188 100 CA  M
189 50  DE  L
190 0   US  M
191 100 US  M
192 50  DE  L
193 100 DE  M
194 50  DE  S
195 100 US  M
196 100 ES  M
197 100 AU  S
198 0   US  M
199 100 US  M
200 100 US  M

In [11]:
# 3) Aplicar uma técnica de discretização (Primeiro foi calculada a mediana para 
#salary_in_usd(salários em dólar) e posteriormente atribuído o valor 0, 
#caso o valor estivesse abaixo ou igual a mediana e 1, caso estivesse acima da mediana)

#install.packages("dplyr")
library(dplyr)

(avg_salary <- median(as.numeric(df$salary_in_usd)))

df_salaries_discr <- df %>% mutate(df_salaries_discr= 
ifelse(salary_in_usd <= avg_salary, "0", "1"))

[1] 101570

In [12]:
#Aplicar uma técnica de Feature Engineering (sugestão: aplicar uma funçao que 
#transforme os campos de ano e mês na quantidade de meses transcorrido desde uma 
#data inicial. Por exemplo, ano 2020/mês 6 representariam 30 meses de antiguidade)

#Considerada como data inicial 01 de julho de 2018 e considerando que no dataframe(df) o mês
#é contabilizado iniciando dia 01. Dessa forma, a quantidade de meses dos anos inteiros é
#calculada como o ano do df(dataframe) menos o ano escolhido como inicial (2018),multiplicado por 12 
#(quantidade de meses no ano). A quantidade de meses do ano inicial é calculada como 12 (quantidade de 
#meses no ano) menos o mês escolhido como inicial (7), mais 1, pois como foi considerado que o mês 
#se incia no dia 1, ele deve ser contabilizado. A quantidade de meses do ano final é calculada como
# o mes no data frame menos um, pois como foi considerado que o mês começa no dia 01, ele não foi 
#contabilizado.

ano_inicial<-2018
mes_inicial<-7
j = length(df$salary_in_usd)
antiguidade_meses<-c()
for(i in 1:j) {antiguidade_meses[i]=(((df$work_year[i]-ano_inicial)*12)+((12-mes_inicial)+1)+((df$work_month[i]-1)))}
df$antiguidade_meses
tail(df)

NULL

    X   work_year work_month experience_level employment_type job_title
602 601 2022       7         EN               FT              Data Analyst
603 602 2022       5         SE               FT              Data Engineer
604 603 2022       6         SE               FT              Data Engineer
605 604 2022      11         SE               FT              Data Analyst
606 605 2022       2         SE               FT              Data Analyst
607 606 2022       3         MI               FT              AI Scientist
    salary salary_currency salary_in_usd employee_residence remote_ratio
602  52000 USD              52000        CA                   0
603 154000 USD             154000        US                 100
604 126000 USD             126000        US                 100
605 129000 USD             129000        US                   0
606 150000 USD             150000        US                 100
607 200000 USD             200000        IN                 100
    company_location company_size
602 CA               M
603 US               M
604 US               M
605 US               M
606 US               M
607 US               L